{
  "name": "Honey Pig Gooldaegee Korean Grill",
  "address": "13818 Braddock Rd. Suite B, Centreville, VA 20121",
  "description": "Korean Barbecue on Weekdays or Any Day at Honey Pig Gooldaegee Korean Grill (Up to 40% Off). Four Locations.",
  "highlight": "Eateries grill spicy pork belly, beef brisket, and seasoned beef ribs tableside; Annandale location is open 24/7",
  "aboutThisDeal": "The sounds of sputtering grill tops, clattering utensils, and lively conversation fill the dining room at Honey Pig Gooldaegee Korean Grill, earning it praise from the Washington Post in 2010 as one of the most entertaining barbecues around. The menu brims with both familiar and adventurous meats, including pork belly, beef ribs, and pork neck. Diners soak in Korean culture via both the food and K-pop, selecting a protein-rich spread and watching as the servers sear their orders on solar-heated tableside grills.",
  "finePrint": "Promotional value expires 90 days after purchase. Amount paid never expires. Valid for Dine-in only. Limit 5 per person, may buy 20 additional as gifts. Limit 1 per visit. Limit 1 per table. Valid only for option purchased. Cannot be combined with other offers. Not valid for lunch specials. Party cannot request to sit separately to use multiple Groupons on the same visit. Not valid Labor Day, Columbus Day, and Veterans Day. Merchant is solely responsible to purchasers for the care and quality of the advertised goods and services.",
  "about": "The sounds of sputtering grill tops, clattering utensils, and lively conversation fill the dining room at Honey Pig Gooldaegee Korean Grill, earning it praise from the Washington Post in 2010 as one of the most entertaining barbecues around. The menu brims with both familiar and adventurous meats, including pork belly, beef ribs, and pork neck. Diners soak in Korean culture via both the food and K-pop, selecting a protein-rich spread and watching as the servers sear their orders on solar-heated tableside grills.",
  "option1": "Annandale: $50 Toward Korean Cuisine; Valid Monday–Thursday",
  "option1Regular": "100",
  "option1Discounted": "1",
  "option1DiscountPercentage": "99",
  "option2": "Centreville: $50 Toward Korean Cuisine; Valid Monday–Thursday",
  "option2Regular": "50",
  "option2Discounted": "1",
  "option2DiscountPercentage": "98",
  "option3": "Ellicott City: $50 Toward Korean Cuisine; Valid Monday–Thursday",
  "option3Regular": "10",
  "option3Discounted": "1",
  "option3DiscountPercentage": "90"
}
